网格收敛性验证/channel/c180_x44_y44/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.2.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;
Lx 12.566370614359172;
Lz 0.1;

Nx 44;
Ny 44;
Nz 1;

vertices
(
    (0 0.0 0)
    ($Lx 0.0 0)
    ($Lx 0.0 $Lz)
    (0 0.0 $Lz)
    (0 0.01201611572380114 0)
    ($Lx 0.01201611572380114 0)
    ($Lx 0.01201611572380114 $Lz)
    (0 0.01201611572380114 $Lz)
    (0 0.02403831824757813 0)
    ($Lx 0.02403831824757813 0)
    ($Lx 0.02403831824757813 $Lz)
    (0 0.02403831824757813 $Lz)
    (0 0.03614946543914914 0)
    ($Lx 0.03614946543914914 0)
    ($Lx 0.03614946543914914 $Lz)
    (0 0.03614946543914914 $Lz)
    (0 0.04899765708867903 0)
    ($Lx 0.04899765708867903 0)
    ($Lx 0.04899765708867903 $Lz)
    (0 0.04899765708867903 $Lz)
    (0 0.06531785124748493 0)
    ($Lx 0.06531785124748493 0)
    ($Lx 0.06531785124748493 $Lz)
    (0 0.06531785124748493 $Lz)
    (0 0.0909554793086754 0)
    ($Lx 0.0909554793086754 0)
    ($Lx 0.0909554793086754 $Lz)
    (0 0.0909554793086754 $Lz)
    (0 0.13085894380869267 0)
    ($Lx 0.13085894380869267 0)
    ($Lx 0.13085894380869267 $Lz)
    (0 0.13085894380869267 $Lz)
    (0 0.18323292199109012 0)
    ($Lx 0.18323292199109012 0)
    ($Lx 0.18323292199109012 $Lz)
    (0 0.18323292199109012 $Lz)
    (0 0.24182934577923135 0)
    ($Lx 0.24182934577923135 0)
    ($Lx 0.24182934577923135 $Lz)
    (0 0.24182934577923135 $Lz)
    (0 0.30219607235782553 0)
    ($Lx 0.30219607235782553 0)
    ($Lx 0.30219607235782553 $Lz)
    (0 0.30219607235782553 $Lz)
    (0 0.3628494474784463 0)
    ($Lx 0.3628494474784463 0)
    ($Lx 0.3628494474784463 $Lz)
    (0 0.3628494474784463 $Lz)
    (0 0.4235291776116147 0)
    ($Lx 0.4235291776116147 0)
    ($Lx 0.4235291776116147 $Lz)
    (0 0.4235291776116147 $Lz)
    (0 0.48421028015360257 0)
    ($Lx 0.48421028015360257 0)
    ($Lx 0.48421028015360257 $Lz)
    (0 0.48421028015360257 $Lz)
    (0 0.5448914230695245 0)
    ($Lx 0.5448914230695245 0)
    ($Lx 0.5448914230695245 $Lz)
    (0 0.5448914230695245 $Lz)
    (0 0.6055725666548218 0)
    ($Lx 0.6055725666548218 0)
    ($Lx 0.6055725666548218 $Lz)
    (0 0.6055725666548218 $Lz)
    (0 0.66625371024636 0)
    ($Lx 0.66625371024636 0)
    ($Lx 0.66625371024636 $Lz)
    (0 0.66625371024636 $Lz)
    (0 0.7269348538379309 0)
    ($Lx 0.7269348538379309 0)
    ($Lx 0.7269348538379309 $Lz)
    (0 0.7269348538379309 $Lz)
    (0 0.7876159974295018 0)
    ($Lx 0.7876159974295018 0)
    ($Lx 0.7876159974295018 $Lz)
    (0 0.7876159974295018 $Lz)
    (0 0.8482971410210728 0)
    ($Lx 0.8482971410210728 0)
    ($Lx 0.8482971410210728 $Lz)
    (0 0.8482971410210728 $Lz)
    (0 0.9089782846126437 0)
    ($Lx 0.9089782846126437 0)
    ($Lx 0.9089782846126437 $Lz)
    (0 0.9089782846126437 $Lz)
    (0 0.9696594282042147 0)
    ($Lx 0.9696594282042147 0)
    ($Lx 0.9696594282042147 $Lz)
    (0 0.9696594282042147 $Lz)
    (0 1.0303405717957856 0)
    ($Lx 1.0303405717957856 0)
    ($Lx 1.0303405717957856 $Lz)
    (0 1.0303405717957856 $Lz)
    (0 1.0910217153873565 0)
    ($Lx 1.0910217153873565 0)
    ($Lx 1.0910217153873565 $Lz)
    (0 1.0910217153873565 $Lz)
    (0 1.1517028589789273 0)
    ($Lx 1.1517028589789273 0)
    ($Lx 1.1517028589789273 $Lz)
    (0 1.1517028589789273 $Lz)
    (0 1.2123840025704982 0)
    ($Lx 1.2123840025704982 0)
    ($Lx 1.2123840025704982 $Lz)
    (0 1.2123840025704982 $Lz)
    (0 1.273065146162069 0)
    ($Lx 1.273065146162069 0)
    ($Lx 1.273065146162069 $Lz)
    (0 1.273065146162069 $Lz)
    (0 1.3337462897536398 0)
    ($Lx 1.3337462897536398 0)
    ($Lx 1.3337462897536398 $Lz)
    (0 1.3337462897536398 $Lz)
    (0 1.394427433345178 0)
    ($Lx 1.394427433345178 0)
    ($Lx 1.394427433345178 $Lz)
    (0 1.394427433345178 $Lz)
    (0 1.4551085769304752 0)
    ($Lx 1.4551085769304752 0)
    ($Lx 1.4551085769304752 $Lz)
    (0 1.4551085769304752 $Lz)
    (0 1.5157897198463972 0)
    ($Lx 1.5157897198463972 0)
    ($Lx 1.5157897198463972 $Lz)
    (0 1.5157897198463972 $Lz)
    (0 1.5764708223883852 0)
    ($Lx 1.5764708223883852 0)
    ($Lx 1.5764708223883852 $Lz)
    (0 1.5764708223883852 $Lz)
    (0 1.6371505525215535 0)
    ($Lx 1.6371505525215535 0)
    ($Lx 1.6371505525215535 $Lz)
    (0 1.6371505525215535 $Lz)
    (0 1.6978039276421744 0)
    ($Lx 1.6978039276421744 0)
    ($Lx 1.6978039276421744 $Lz)
    (0 1.6978039276421744 $Lz)
    (0 1.7581706542207685 0)
    ($Lx 1.7581706542207685 0)
    ($Lx 1.7581706542207685 $Lz)
    (0 1.7581706542207685 $Lz)
    (0 1.8167670780089096 0)
    ($Lx 1.8167670780089096 0)
    ($Lx 1.8167670780089096 $Lz)
    (0 1.8167670780089096 $Lz)
    (0 1.869141056191307 0)
    ($Lx 1.869141056191307 0)
    ($Lx 1.869141056191307 $Lz)
    (0 1.869141056191307 $Lz)
    (0 1.9090445206913245 0)
    ($Lx 1.9090445206913245 0)
    ($Lx 1.9090445206913245 $Lz)
    (0 1.9090445206913245 $Lz)
    (0 1.934682148752515 0)
    ($Lx 1.934682148752515 0)
    ($Lx 1.934682148752515 $Lz)
    (0 1.934682148752515 $Lz)
    (0 1.9510023429113208 0)
    ($Lx 1.9510023429113208 0)
    ($Lx 1.9510023429113208 $Lz)
    (0 1.9510023429113208 $Lz)
    (0 1.9638505345608508 0)
    ($Lx 1.9638505345608508 0)
    ($Lx 1.9638505345608508 $Lz)
    (0 1.9638505345608508 $Lz)
    (0 1.9759616817524217 0)
    ($Lx 1.9759616817524217 0)
    ($Lx 1.9759616817524217 $Lz)
    (0 1.9759616817524217 $Lz)
    (0 1.9879838842761988 0)
    ($Lx 1.9879838842761988 0)
    ($Lx 1.9879838842761988 $Lz)
    (0 1.9879838842761988 $Lz)
    (0 2.0 0)
    ($Lx 2.0 0)
    ($Lx 2.0 $Lz)
    (0 2.0 $Lz)
);

blocks
(
    hex (0 1 5 4 3 2 6 7) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (4 5 9 8 7 6 10 11) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (8 9 13 12 11 10 14 15) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (12 13 17 16 15 14 18 19) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (16 17 21 20 19 18 22 23) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (20 21 25 24 23 22 26 27) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (24 25 29 28 27 26 30 31) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (28 29 33 32 31 30 34 35) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (32 33 37 36 35 34 38 39) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (36 37 41 40 39 38 42 43) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (40 41 45 44 43 42 46 47) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (44 45 49 48 47 46 50 51) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (48 49 53 52 51 50 54 55) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (52 53 57 56 55 54 58 59) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (56 57 61 60 59 58 62 63) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (60 61 65 64 63 62 66 67) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (64 65 69 68 67 66 70 71) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (68 69 73 72 71 70 74 75) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (72 73 77 76 75 74 78 79) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (76 77 81 80 79 78 82 83) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (80 81 85 84 83 82 86 87) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (84 85 89 88 87 86 90 91) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (88 89 93 92 91 90 94 95) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (92 93 97 96 95 94 98 99) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (96 97 101 100 99 98 102 103) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (100 101 105 104 103 102 106 107) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (104 105 109 108 107 106 110 111) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (108 109 113 112 111 110 114 115) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (112 113 117 116 115 114 118 119) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (116 117 121 120 119 118 122 123) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (120 121 125 124 123 122 126 127) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (124 125 129 128 127 126 130 131) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (128 129 133 132 131 130 134 135) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (132 133 137 136 135 134 138 139) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (136 137 141 140 139 138 142 143) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (140 141 145 144 143 142 146 147) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (144 145 149 148 147 146 150 151) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (148 149 153 152 151 150 154 155) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (152 153 157 156 155 154 158 159) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (156 157 161 160 159 158 162 163) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (160 161 165 164 163 162 166 167) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (164 165 169 168 167 166 170 171) ($Nx 1 $Nz) simpleGrading (1 1 1)
    hex (168 169 173 172 171 170 174 175) ($Nx 1 $Nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)
            (12 15 19 16)
            (16 19 23 20)
            (20 23 27 24)
            (24 27 31 28)
            (28 31 35 32)
            (32 35 39 36)
            (36 39 43 40)
            (40 43 47 44)
            (44 47 51 48)
            (48 51 55 52)
            (52 55 59 56)
            (56 59 63 60)
            (60 63 67 64)
            (64 67 71 68)
            (68 71 75 72)
            (72 75 79 76)
            (76 79 83 80)
            (80 83 87 84)
            (84 87 91 88)
            (88 91 95 92)
            (92 95 99 96)
            (96 99 103 100)
            (100 103 107 104)
            (104 107 111 108)
            (108 111 115 112)
            (112 115 119 116)
            (116 119 123 120)
            (120 123 127 124)
            (124 127 131 128)
            (128 131 135 132)
            (132 135 139 136)
            (136 139 143 140)
            (140 143 147 144)
            (144 147 151 148)
            (148 151 155 152)
            (152 155 159 156)
            (156 159 163 160)
            (160 163 167 164)
            (164 167 171 168)
            (168 171 175 172)
        );
    }

    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces
        (
            (1 5 6 2)
            (5 9 10 6)
            (9 13 14 10)
            (13 17 18 14)
            (17 21 22 18)
            (21 25 26 22)
            (25 29 30 26)
            (29 33 34 30)
            (33 37 38 34)
            (37 41 42 38)
            (41 45 46 42)
            (45 49 50 46)
            (49 53 54 50)
            (53 57 58 54)
            (57 61 62 58)
            (61 65 66 62)
            (65 69 70 66)
            (69 73 74 70)
            (73 77 78 74)
            (77 81 82 78)
            (81 85 86 82)
            (85 89 90 86)
            (89 93 94 90)
            (93 97 98 94)
            (97 101 102 98)
            (101 105 106 102)
            (105 109 110 106)
            (109 113 114 110)
            (113 117 118 114)
            (117 121 122 118)
            (121 125 126 122)
            (125 129 130 126)
            (129 133 134 130)
            (133 137 138 134)
            (137 141 142 138)
            (141 145 146 142)
            (145 149 150 146)
            (149 153 154 150)
            (153 157 158 154)
            (157 161 162 158)
            (161 165 166 162)
            (165 169 170 166)
            (169 173 174 170)
        );
    }

    bottomWall
    {
        type            wall;
        faces
        (
            (0 1 2 3)
        );
    }

    topWall
    {
        type            wall;
        faces
        (
            (173 172 175 174)
        );
    }

    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
            (8 12 13 9)
            (12 16 17 13)
            (16 20 21 17)
            (20 24 25 21)
            (24 28 29 25)
            (28 32 33 29)
            (32 36 37 33)
            (36 40 41 37)
            (40 44 45 41)
            (44 48 49 45)
            (48 52 53 49)
            (52 56 57 53)
            (56 60 61 57)
            (60 64 65 61)
            (64 68 69 65)
            (68 72 73 69)
            (72 76 77 73)
            (76 80 81 77)
            (80 84 85 81)
            (84 88 89 85)
            (88 92 93 89)
            (92 96 97 93)
            (96 100 101 97)
            (100 104 105 101)
            (104 108 109 105)
            (108 112 113 109)
            (112 116 117 113)
            (116 120 121 117)
            (120 124 125 121)
            (124 128 129 125)
            (128 132 133 129)
            (132 136 137 133)
            (136 140 141 137)
            (140 144 145 141)
            (144 148 149 145)
            (148 152 153 149)
            (152 156 157 153)
            (156 160 161 157)
            (160 164 165 161)
            (164 168 169 165)
            (168 172 173 169)
        );
    }

    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (
            (3 2 6 7)
            (7 6 10 11)
            (11 10 14 15)
            (15 14 18 19)
            (19 18 22 23)
            (23 22 26 27)
            (27 26 30 31)
            (31 30 34 35)
            (35 34 38 39)
            (39 38 42 43)
            (43 42 46 47)
            (47 46 50 51)
            (51 50 54 55)
            (55 54 58 59)
            (59 58 62 63)
            (63 62 66 67)
            (67 66 70 71)
            (71 70 74 75)
            (75 74 78 79)
            (79 78 82 83)
            (83 82 86 87)
            (87 86 90 91)
            (91 90 94 95)
            (95 94 98 99)
            (99 98 102 103)
            (103 102 106 107)
            (107 106 110 111)
            (111 110 114 115)
            (115 114 118 119)
            (119 118 122 123)
            (123 122 126 127)
            (127 126 130 131)
            (131 130 134 135)
            (135 134 138 139)
            (139 138 142 143)
            (143 142 146 147)
            (147 146 150 151)
            (151 150 154 155)
            (155 154 158 159)
            (159 158 162 163)
            (163 162 166 167)
            (167 166 170 171)
            (171 170 174 175)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
