网格收敛性验证/channel/c180_x44_y44/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// This is only for perturbUChannnel!
Ubar              Ubar [ 0 1 -1 0 0 0 0 ] (1 0 0);

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 3.5e-04;
// Re180=3.5e-04, Re550=1.145e-04, Re950=6.6e-05, Re2000=3.15e-05,Re4200=1.5e-05,Re10000=6.3e-06 //

// ************************************************************************* //
