网格收敛性验证/channel/c180_x44_y44/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
1892
(
(0.1734269173526847 0.004489272758377822 -0.03020133989705309)
(0.1794715031694593 -0.006144369967916941 -0.03129621572517832)
(0.1615226787425841 0.009970922717371341 -0.008073656148088902)
(0.1878031298125443 0.006714830383906332 -0.04472290746247645)
(0.2269532237655631 -0.003545651474916993 -0.02772588994200786)
(0.2205569342600821 -0.003326523746701173 0.001063032622329916)
(0.229267901852768 -0.003642553916037249 -0.0006658040996921786)
(0.2524218662315939 0.003766458607546169 -0.00712373209150481)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
